nacaAirfoil/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     sonicFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.0027;

deltaT          4e-08;

writeControl    runTime;

writeInterval   2e-04;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    forces
    {
        type            forceCoeffs;
        libs            (forces);
        writeControl    writeTime;

        patches
        (
            wall_4
        );

        rhoInf      1;

        CofR        (0 0 0);
        liftDir     (-0.239733 0.970839 0);
        dragDir     (0.970839 0.239733 0);
        pitchAxis   (0 0 1);
        magUInf     618.022;
        lRef        1;
        Aref        1;
    }
}


// ************************************************************************* //
